<script>
    export let onStart;
</script>

<div>
    <div class="center">
        <h1>Привіт!</h1>
        <h2>Дякую, що зайшли.</h2>
    </div>
    <p>
        Я хочу розробити гру у сеттінгу Гаррі Поттера, по суті шутер,
        але замість ствола у вас чарівна паличка,
        а замість пострілу ви волаєте закляття в мікрофон.
    </p>
    <p>
        Для таких фінтів вухами мені потрібен нехілий датасет, аби навчити
        модель розпізнавати усі тембри, діалекти і виговори.
    </p>
    <p>
        Цей сайт створений для збору датасету, і ви, якщо маєте змогу,
        бажання та час, можете допомогти мені, зачитуючи закляття у мікрофон.
    </p>
    <p>
        Збір семплів повністю анонімний. Зібрані дані і доступ до них ніколи не будуть надані жодній третій стороні чи особі.
        Результуючим продуктом буде нейромережа, реконструкція оригінального аудіо з якої неможлива.
    </p>
    <p>
        Увесь вихідний код ви можете знайти за <a href="https://github.com/HP-Voice">посиланням</a>.
    </p>
    <div class="center">
        <button class="continue" on:click="{onStart}">Поїхали</button>
    </div>
</div>

<style>
    .center {
        text-align: center;
    }
    .continue {
        background: cadetblue;
    }
</style>
